{
 "architectures": ["LLaMAForCausalLM"],
 "bos_token_id": 1,
 "eos_token_id": 2,
 "hidden_act": "silu",
 "hidden_size": 1024,
 "intermediate_size": 12288,
 "initializer_range": 0.02,
 "max_sequence_length": 2048,
 "model_type": "llama",
 "num_attention_heads": 32,
 "num_hidden_layers": 32,
 "pad_token_id": 0,
 "rms_norm_eps": 1e-05,
 "torch_dtype": "float32",
 "transformers_version": "4.29.1",
 "use_cache": true,
 "vocab_size": 64076
 }